{
  "backend/main.mo": "Main backend actor implementing checklist entry management, user profiles, and role-based access control with admin bootstrap login, blob storage integration, and CRUD operations for store checklist entries.",
  "feature_evidence.json": "Feature evidence report documenting three high-confidence features: backend connection debugging, comprehensive error handling in useBackendActor, and elimination of runtime errors across the application.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend files including components, hooks, pages, and utilities with focus on glassmorphism design, error handling, and backend connection management.",
  "frontend/index.css": "Global Tailwind CSS styles defining OKLCH color variables for light and dark modes with custom CSS variables for UI components including sidebar, charts, and theme colors.",
  "frontend/index.html": "HTML entry point with title \"Protect\", favicon reference, and script tag loading the React application from main.tsx.",
  "frontend/src/App.tsx": "Root application component configuring TanStack Router with routes for login, user checklist, and admin dashboard, plus QueryClient setup with smart cache clearing on identity changes.",
  "frontend/src/components/AdminAccessRecovery.tsx": "Admin credential login form that validates Admin/Admin credentials locally and grants immediate dashboard access by saving an admin session token without backend verification.",
  "frontend/src/components/AppHeader.tsx": "Application header displaying Protect logo with gradient text and logout button that clears query cache, Internet Identity, and navigates to login page.",
  "frontend/src/components/AppLayout.tsx": "Shared layout wrapper component providing consistent structure with AppHeader, main content area, and footer displaying copyright notice.",
  "frontend/src/components/CameraCaptureModal.tsx": "Modal dialog component for capturing photos using device camera with video preview, error handling for permissions/support, and capture/cancel controls.",
  "frontend/src/components/ChecklistItemCard.tsx": "Card component displaying a checklist item with photo preview, capture/retake button, and integration with CameraCaptureModal for photo capture.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal dialog for initial user profile setup that prompts for name input with form validation and save functionality.",
  "frontend/src/hooks/useActor.ts": "React Query hook that creates and manages the backend actor instance with Internet Identity authentication, including admin token initialization and query invalidation on identity changes.",
  "frontend/src/hooks/useAdminAuthorization.ts": "Hook that checks if the current Internet Identity principal has admin role by calling backend, with error handling for connectivity vs authorization failures.",
  "frontend/src/hooks/useAdminBootstrap.ts": "Hook for attempting admin bootstrap by calling backend's initialize() method, invalidating admin authorization queries on success.",
  "frontend/src/hooks/useAdminCredentialLogin.ts": "Hook for submitting admin username/password credentials to backend login() method with error classification and admin status refresh on success.",
  "frontend/src/hooks/useAdminSession.ts": "Hook for managing admin session tokens in sessionStorage with reactive state and methods to save/clear tokens.",
  "frontend/src/hooks/useBackendActor.ts": "Wrapper hook around useActor that provides explicit readiness state, version tracking, health checks via ping, retry capabilities, and invalidates admin authorization on actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "React hook and provider for Internet Identity authentication, managing login state, identity persistence, and delegation validation with configurable AuthClient options.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks for backend operations including user profiles, checklist entries, and admin-gated queries with error normalization and authorization checks.",
  "frontend/src/index.css": "Tailwind CSS configuration with glassmorphism design system using OKLCH color space, defining light/dark mode palettes and utility classes for glass effects and safe areas.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClient and InternetIdentityProvider wrappers around the main App component.",
  "frontend/src/pages/AdminDashboard.tsx": "Admin dashboard page displaying all checklist submissions with admin token-based access control, backend connection status handling, and navigation to submission details.",
  "frontend/src/pages/AdminSubmissionDetail.tsx": "Admin page for viewing individual checklist submission details, protected by admin token with entry fetching and backend connection error handling.",
  "frontend/src/pages/LoginChoice.tsx": "Login page component that provides user and admin login options, handles Internet Identity authentication, displays backend connection status with retry capability, and shows an admin credential recovery modal when admin access is selected.",
  "frontend/src/pages/UserChecklist.tsx": "User checklist page that allows authenticated users to submit store inspection entries with photos for predefined checklist items (doors, windows, cash), validates all photos are captured, and displays success/error messages with profile setup modal support.",
  "frontend/src/utils/adminSession.ts": "Utility module for managing admin bootstrap credentials in sessionStorage, providing functions to get, set, clear, and check admin tokens and redirect messages that persist only for the browser session.",
  "frontend/src/utils/backendErrors.ts": "Error classification utility that normalizes backend, replica, and HTTP agent errors into user-friendly messages, categorizing them as network, backend-unavailable, unauthorized, configuration, or unknown errors with retry recommendations.",
  "frontend/src/utils/urlParams.ts": "URL parameter parsing utilities that work with both hash-based and query string routing, providing functions to extract, persist, and clear parameters from URLs and sessionStorage with support for sensitive data removal from the address bar.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration file defining custom color schemes using OKLCH color space, extended utilities for glassmorphism effects, container queries, typography, animations, and custom keyframes for accordion components.",
  "project_state.json": "Project state tracking a fix request for backend connection errors and runtime issues. Contains three existing features addressing backend connectivity, error handling in useBackendActor, and elimination of console warnings, plus two pending action requests for canister ID verification and backend deployment validation."
}