{
  "backend/main.mo": "Motoko canister with access-controlled user profiles and checklist entry creation plus admin-only query filters and storage mixins.",
  "feature_evidence.json": "Feature evidence report mapping backend and frontend files to implemented feature IDs with confidence levels.",
  "frontend-file-summaries.txt": "Text file listing short summaries for major frontend source files.",
  "frontend/index.css": "Base Tailwind setup defining OKLCH color variables and dark mode styles.",
  "frontend/index.html": "HTML entry point loading the React app via main.tsx.",
  "frontend/src/App.tsx": "Sets up TanStack Router routes and root layout that clears sessions when identity changes.",
  "frontend/src/components/AppHeader.tsx": "Header with logo and logout button that clears identity, cache, and admin session.",
  "frontend/src/components/AppLayout.tsx": "Layout wrapper providing header, main content area, and footer.",
  "frontend/src/components/CameraCaptureModal.tsx": "Camera modal using useCamera to start/stop video, handle errors, and capture photos.",
  "frontend/src/components/ChecklistItemCard.tsx": "UI card for a checklist item that displays a captured photo and opens a camera modal to take or retake it.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal prompting the user to enter and save their name with simple form handling.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the backend actor based on Internet Identity, refreshing dependent queries when the actor changes.",
  "frontend/src/hooks/useAdminBootstrap.ts": "Empty placeholder file with no implementation.",
  "frontend/src/hooks/useAdminSession.ts": "Manages admin session credentials with persistence and cross‑tab synchronization.",
  "frontend/src/hooks/useBackendActor.ts": "Wrapper around useActor that provides readiness, loading, and error states plus a retry method.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context and provider for Internet Identity authentication, exposing identity, login, logout, and status flags.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks for user profiles, checklist entries, and admin data, using the backend actor with error handling.",
  "frontend/src/index.css": "Tailwind setup with light and dark theme CSS variables and global styling.",
  "frontend/src/main.tsx": "Application entry point initializing React Query, Internet Identity provider, and rendering App.",
  "frontend/src/pages/AdminDashboard.tsx": "Admin dashboard fetching and filtering entries, handling session validation and backend errors.",
  "frontend/src/pages/AdminSubmissionDetail.tsx": "Displays details of a specific submission with admin session checks and backend error handling.",
  "frontend/src/pages/LoginChoice.tsx": "Login screen offering user login via Internet Identity and admin login via manual credentials.",
  "frontend/src/pages/UserChecklist.tsx": "User checklist form allowing photo capture, profile handling, and creating backend checklist entries.",
  "frontend/src/utils/adminSession.ts": "Utility for storing, retrieving, and clearing admin credentials and redirect messages in sessionStorage.",
  "frontend/src/utils/backendErrors.ts": "Utility for normalizing backend errors and detecting unauthorized or backend-unavailable states.",
  "frontend/src/utils/urlParams.ts": "Provides helpers for reading URL parameters, storing/retrieving them in sessionStorage, and cleaning them from the hash for routing and persistence.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors, typography, container settings, animations, and plugins.",
  "project_state.json": "Tracks project state, known admin login issues, and pending feature requests related to authentication and backend connectivity."
}