{
  "backend/main.mo": "Motoko canister managing user profiles and store checklist entries with admin-gated queries and storage mixins.",
  "feature_evidence.json": "JSON report documenting a feature removal related to footer branding and listing affected files and components.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of various frontend source files for reference.",
  "frontend/index.css": "Tailwind CSS base and theme variables defining light/dark color tokens and global styles.",
  "frontend/index.html": "Basic HTML entry point mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Configures TanStack Router routes and root layout that resets admin session when identity changes.",
  "frontend/src/components/AppHeader.tsx": "Header with logo and logout logic that clears identity, query cache, and admin session.",
  "frontend/src/components/AppLayout.tsx": "Layout component providing header, main content area, and a simple footer.",
  "frontend/src/components/CameraCaptureModal.tsx": "Modal for camera photo capture with error handling, preview, and start/stop control.",
  "frontend/src/components/ChecklistItemCard.tsx": "Card showing a checklist item with photo preview and a camera modal trigger.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal requiring users to enter and save their name before continuing.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the current Internet Identity, reinitializing on identity changes and invalidating dependent queries.",
  "frontend/src/hooks/useAdminBootstrap.ts": "Empty file.",
  "frontend/src/hooks/useAdminSession.ts": "Manages admin session credentials with sessionStorage syncing and helper methods for saving and clearing.",
  "frontend/src/hooks/useBackendActor.ts": "Wraps useActor to expose actor readiness, loading, error state, and a retry mechanism.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides context and hooks for Internet Identity authentication, loading stored identities, and handling login state.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for user profiles, checklist entries, and admin-only data with backend error handling.",
  "frontend/src/index.css": "Tailwind base styles plus custom light/dark theme variables and utility classes.",
  "frontend/src/main.tsx": "Bootstraps the app with React Query and Internet Identity providers and mounts the React root.",
  "frontend/src/pages/AdminDashboard.tsx": "Admin dashboard page showing checklist entries with filtering, error handling, and admin-session enforcement.",
  "frontend/src/pages/AdminSubmissionDetail.tsx": "Displays details for a specific admin submission with session checks, backend error handling, and retry logic.",
  "frontend/src/pages/LoginChoice.tsx": "Provides user or admin login flow using Internet Identity or a form, handling credential validation, errors, and redirects.",
  "frontend/src/pages/UserChecklist.tsx": "Implements the user checklist form with photo capture, validation, profile handling, and checklist submission to the backend.",
  "frontend/src/utils/adminSession.ts": "Manages storing, retrieving, and clearing admin session data and redirect messages in sessionStorage.",
  "frontend/src/utils/backendErrors.ts": "Normalizes backend errors into user-friendly messages and provides helpers to detect backend unavailability or invalid admin credentials.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading URL parameters, persisting them in sessionStorage, and cleaning them from the URL hash.",
  "frontend/tailwind.config.js": "Tailwind configuration defining theme extensions, colors, animations, and plugin setup for the frontend UI.",
  "project_state.json": "Contains project metadata, versioning, features, and pending requests for the Store Checklist Pro application."
}