{
  "backend/main.mo": "Main backend actor managing user profiles, checklist submissions, and admin-gated queries with storage and authorization mixins.",
  "backend/migration.mo": "Migration module that copies checklist entries and user profiles from the old canister state to the new one without modification.",
  "feature_evidence.json": "Feature evidence report mapping features to affected frontend files, components, and test IDs.",
  "frontend-file-summaries.txt": "Text file containing prewritten summaries for various frontend components, pages, hooks, and utilities.",
  "frontend/index.css": "Tailwind base and theme variables defining color tokens and global styling for light and dark modes.",
  "frontend/index.html": "HTML entry point loading the React app and favicon.",
  "frontend/src/App.tsx": "Sets up TanStack Router routes and root layout handling identity changes and query cache clearing.",
  "frontend/src/components/AppHeader.tsx": "Header with branding and logout button that clears identity and query cache before redirecting.",
  "frontend/src/components/AppLayout.tsx": "Layout wrapper providing header, main content region, and footer.",
  "frontend/src/components/CameraCaptureModal.tsx": "Camera modal using useCamera hook to start/stop the camera, capture photos, and show camera-related errors.",
  "frontend/src/components/ChecklistItemCard.tsx": "Displays a checklist item with optional photo preview and opens a camera capture modal to add or retake a photo.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal prompting the user to enter and save their name, with form handling and disabled states during saving.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user's identity, refetching dependent queries when the actor changes.",
  "frontend/src/hooks/useAdminAuthorization.ts": "Checks whether the current user has admin privileges using the backend actor and caches the result.",
  "frontend/src/hooks/useAdminBootstrap.ts": "Empty file.",
  "frontend/src/hooks/useAdminSession.ts": "Empty file.",
  "frontend/src/hooks/useBackendActor.ts": "Wraps useActor to provide readiness, error handling, health checks, and retry logic for backend actor usage.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity context, login/logout functionality, identity loading, and status management via AuthClient.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for user profile, checklist entries, and admin-only data with backend error normalization and health checks.",
  "frontend/src/index.css": "Tailwind setup defining light/dark glassmorphism theme variables, global styles, and custom utility classes.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with React Query and Internet Identity providers.",
  "frontend/src/pages/AdminDashboard.tsx": "Displays admin-only list of checklist submissions with filtering, error handling, and authorization checks.",
  "frontend/src/pages/AdminSubmissionDetail.tsx": "Shows detailed information for a single checklist submission with admin authorization and backend-loading states.",
  "frontend/src/pages/LoginChoice.tsx": "Handles user/admin login flow using Internet Identity with routing, error states, and role-based redirects.",
  "frontend/src/pages/UserChecklist.tsx": "Allows users to complete a checklist, capture photos, save profiles, and submit entries to the backend.",
  "frontend/src/utils/adminSession.ts": "Empty file placeholder for admin session utilities.",
  "frontend/src/utils/backendErrors.ts": "Provides functions to classify, normalize, and detect backend and network errors for user‑friendly messaging.",
  "frontend/src/utils/urlParams.ts": "Provides helpers for reading URL and hash parameters, persisting them in sessionStorage, and removing parameters from the URL hash.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining theming, colors, typography, container settings, animations, and plugin usage.",
  "project_state.json": "JSON metadata describing project state, known issues, existing features, and pending feature requests."
}