{
  "backend/main.mo": "Actor handling user profiles, authorization, and store checklist entries with CRUD and filtering plus migration and blob storage mixins.",
  "backend/migration.mo": "Migration drops deprecated admin credentials while preserving user profiles and checklist entries.",
  "feature_evidence.json": "Feature evidence report mapping features to files, components, tests, and confidence levels.",
  "frontend-file-summaries.txt": "Prewritten summaries for numerous frontend files describing layout, styling, hooks, and error‑handling behavior.",
  "frontend/index.css": "Tailwind base styles defining color tokens, dark mode variables, and global glassmorphism utility behavior.",
  "frontend/index.html": "Basic HTML entry point injecting React root and main script.",
  "frontend/src/App.tsx": "Sets up TanStack Router with routes, root layout, and identity-based cache clearing on logout.",
  "frontend/src/components/AppHeader.tsx": "Header with branding and logout logic that clears identity, query cache, and admin session.",
  "frontend/src/components/AppLayout.tsx": "Layout wrapper providing header, main content, and simplified footer.",
  "frontend/src/components/CameraCaptureModal.tsx": "Camera modal using useCamera hook for photo capture with detailed user-friendly camera error messages.",
  "frontend/src/components/ChecklistItemCard.tsx": "Renders a checklist item card with photo preview and a button to open a camera capture modal.",
  "frontend/src/components/ProfileSetupModal.tsx": "Displays a modal prompting the user to enter and save their name with form handling and validation.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity, reinitializing and invalidating queries when identity changes.",
  "frontend/src/hooks/useAdminBootstrap.ts": "Empty file with no implementation.",
  "frontend/src/hooks/useAdminSession.ts": "Manages admin session credentials with storage syncing and helper methods for saving and clearing sessions.",
  "frontend/src/hooks/useBackendActor.ts": "Wraps useActor with readiness checks, health checks, retry logic, and detailed error reporting for backend connectivity.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides context and utilities for Internet Identity login, identity loading, and status tracking.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for user profiles, checklist entries, and admin data with backend error normalization and health checks.",
  "frontend/src/index.css": "Defines Tailwind base styles and a glassmorphism-themed light/dark color system with utility classes.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/AdminDashboard.tsx": "Admin dashboard listing checklist submissions with store/date filters and backend session/error handling.",
  "frontend/src/pages/AdminSubmissionDetail.tsx": "Displays detailed information for a specific submission with retry, session validation, and backend loading/error states.",
  "frontend/src/pages/LoginChoice.tsx": "Login screen supporting Internet Identity user login and simple admin login with backend connection handling.",
  "frontend/src/pages/UserChecklist.tsx": "User checklist form capturing store name and photos, validating input, and submitting entries to the backend.",
  "frontend/src/utils/adminSession.ts": "Utility functions for storing, retrieving, and clearing admin session data and redirect messages in sessionStorage.",
  "frontend/src/utils/backendErrors.ts": "Error classification and normalization utilities converting backend errors into user-friendly messages and categories.",
  "frontend/src/utils/urlParams.ts": "Provides helpers to read URL and hash parameters, persist them in sessionStorage, and clear them from the URL.",
  "frontend/tailwind.config.js": "Defines Tailwind CSS configuration with custom colors, typography, container settings, animations, and extended theme utilities.",
  "project_state.json": "Describes the project’s current state, known issues, and existing feature requirements for the Protect app."
}